#+TITLE: Finding Cycles

* Example: Finding $\mu$ and $\lambda$
#+BEGIN_SRC python :exports both :results output
# define f(x)
def f(x):
    # Try changing 5, 16, and x_0 and see how mu and lambda change.
    # The maximum possible lambda is attainable when the number in place of 16
    # is a power of a prime number, x_0 is coprime with that number, and the
    # number in place of 5 is 3 or 5 modulo 8.
    return x * 5 % 16

# assign x_k = x_1 and x_2k = x_2
x_0 = 3
x_k = f(x_0);
x_2k = f(f(x_0));
k = 1

# find x_k = x_2k
while x_k != x_2k:
    x_k = f(x_k)
    # step x_2k twice as fast as x_k so 2k is always twice k
    x_2k = f(f(x_2k))
    k = k + 1

# find mu and lambda
x_i = x_0
x_kpi = x_k # kpi means k + i
i = 0
lam = None # lambda
while x_i != x_kpi:
    # step x_i, x_kpi, and i
    x_i = f(x_i)
    x_kpi = f(x_kpi)
    i = i + 1

    # if x_kpi = x_k, then we found lambda
    if lam == None and x_kpi == x_k:
        lam = i

# if we didn't find lambda, then k must be lambda
if lam == None:
    lam = k

print("mu = " + str(i))
print("lambda = " + str(lam))
#+END_SRC

#+RESULTS:
: mu = 0
: lambda = 4

* Example: Finding Only $\lambda$
#+BEGIN_SRC python :exports both :results output
# define f(x)
def f(x):
    # Try changing 5, 16, and x_0 and see how lambda changes.
    # The maximum possible lambda is attainable when the number in place of 16
    # is a power of a prime number, x_0 is coprime with that number, and the
    # number in place of 5 is 3 or 5 modulo 8.
    return x * 5 % 16

# set x_k = x_0, x_n = x_1
x_0 = 3
k = 0
x_k = x_0
n = 1
x_n = f(x_0)

# find lambda
while x_n != x_k:
    # x_n is one less than a power of 2 -> set k = n, x_k = x_n
    if n & (n + 1) == 0:
        k = n
        x_k = x_n

    # step n, x_n
    x_n = f(x_n)
    n = n + 1

print("lambda = " + str(n - k))
#+END_SRC

#+RESULTS:
: lambda = 4
